{
  "cv_text": "Evelyn Moura dos Santos \nCidade: São Paulo - SP \nCEP: 03819-150 \nTelefone: (11) 97662-9860 | (11) 99236-8678 \nE-mail: evemoura56@gmail.com \n \nResumo Profissional: \nEngenheira de Soluções Full-Stack com background sólido em Operações de alta criticidade (GOL) . \nFoco em arquitetura e desenvolvimento de aplicações de IA (Python, FastAPI, Gemini API) e automação \nde processos (Java). Habilidade comprovada em deploy de PaaS (Render) e troubleshooting \navançado de ambientes (PATH, pip, venv) e conflitos de API. \nFormação e Certificações: \nFormação Analista de Dados (52h) - - SQL Server, Power BI, SSIS/SSAS \nUdemy, 2025  \nCurso Superior de Tecnologia (CST), Marketing Digital (Graduação) \nCruzeiro do Sul Virtual | 2022 – 2024 \nCurso Técnico em Informática - ETEC \nCentro Paula Souza, 2019 \nCompetências: \n●​ Engenharia de Software e IA \n●​ Engenharia de Backend: Python (FastAPI), Java. \n●​ Arquitetura de IA Híbrida: Google Gemini API (v1.46.0), DuckDuckGo Search (DDGS). \n●​ Engenharia de Frontend: HTML, CSS, JavaScript. \n●​ Engenharia de Deploy: Render (PaaS), Cloudflare Tunnel. \n●​ Análise e Operações \n●​ Troubleshooting Avançado: Debug de Ambiente, Conflito de API, Sistemas Críticos (Sabre). \n●​ Otimização de Processos (RPA) \n●​ Análise de Dados: SQL Server, Power BI, Looker Studio. \n●​ Gestão de Contingência: (Experiência GOL) . \nExperiências Profissionais: \nAgente Sênior de Operações e Sistemas \nGOL Linhas Aéreas (2022 - 2024) \n●​ Ponto focal técnico para a supervisão na resolução de falhas complexas nos sistemas críticos \n(Sabre, Zendesk). \n\n●​ Especialista em troubleshooting de processos operacionais (Check-in, Embarque, Reembolso), \nidentificando e executando rotas de contorno (workarounds) em tempo real. \n●​ Responsável pela gestão de contingência (\"Erro Fatal\"), aplicando regras de negócio complexas \nsob pressão para garantir a continuidade da operação. \nAssistente Administrativo e de Marketing \nAgência Antonella (2024 – 2025) \n●​ Suporte administrativo à diretoria e gestão de fluxo de comunicação com clientes. \n●​ Criação de calendários de conteúdo, copys e roteiros com suporte de IA (ChatGPT). \nProjetos de Engenharia (Cases Reais) \n\"Evelyn PRO\" - Engenharia de Soluções Full-Stack (Python/FastAPI) \nLink da Prova: https://evelynpro.onrender.com \n●​ Descrição: Desenvolvi e publiquei uma aplicação de IA full-stack para resolver gargalos de busca \ne análise de vagas. \n●​ Tecnologias: Python (FastAPI), Google Gemini API (v1.46.0), DuckDuckGo Search (DDGS), \nHTML/CSS/JS. \n●​ Infra/Deploy: Engenharia de Deploy em PaaS (Render), debug avançado de ambiente (Python \nvenv, PATH, pip cache) e resolução de conflitos de migração de API (v1beta vs v1). \n●​ Resultado: Aplicação funcional com motor híbrido de busca real (DDGS) e análise (IA) para \nentregar vagas ativas e otimizar CVs. \nAutomação de Processos (Java) \n●​ Desenvolvimento de ferramenta que reduziu 83% do tempo de execução de tarefa \nmanual (de 4h para 40min). \nAnálise de Performance (IA/Gemini) \n●​ Análise de performance de SDR utilizando IA (Gemini) para interpretar dados brutos \n(Looker Studio) e propor melhorias de script. \n \n \n",
  "cv_summary": "Aqui está um resumo profissional claro e breve baseado no currículo fornecido, ideal para a seção \"Sobre\" do LinkedIn ou para o topo de um currículo:\n\n---\n\n**Engenheira de Soluções Full-Stack com sólida experiência em Operações de alta criticidade, oriunda da GOL Linhas Aéreas, onde atuou na resolução e gestão de falhas complexas em sistemas críticos.** Especialista no desenvolvimento de aplicações de IA (Python, FastAPI, Google Gemini API) e automação de processos (Java), com expertise em deploy de PaaS (Render) e troubleshooting avançado de ambientes e APIs. Demonstra habilidade comprovada em aplicar regras de negócio sob pressão e garantir a continuidade operacional.\n\n---"
}